handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/inc/n32g05x_dma.h
#define DMA_INT_GLB1 ((uint32_t)DMA_INTSTS_GLBF1) /* DMA channel1 global interrupt */
#define DMA_INT_TXC1 ((uint32_t)DMA_INTSTS_TXCF1) /* DMA channel1 transfer complete interrupt */
#define DMA_INT_HTX1 ((uint32_t)DMA_INTSTS_HTXF1) /* DMA channel1 half transfer interrupt */
#define DMA_INT_ERR1 ((uint32_t)DMA_INTSTS_ERRF1) /* DMA channel1 transfer error interrupt */
#define DMA_INT_GLB2 ((uint32_t)DMA_INTSTS_GLBF2) /* DMA channel2 global interrupt */
#define DMA_INT_TXC2 ((uint32_t)DMA_INTSTS_TXCF2) /* DMA channel2 transfer complete interrupt */
#define DMA_INT_HTX2 ((uint32_t)DMA_INTSTS_HTXF2) /* DMA channel2 half transfer interrupt */
#define DMA_INT_ERR2 ((uint32_t)DMA_INTSTS_ERRF2) /* DMA channel2 transfer error interrupt */
#define DMA_INT_GLB3 ((uint32_t)DMA_INTSTS_GLBF3) /* DMA channel3 global interrupt */
#define DMA_INT_TXC3 ((uint32_t)DMA_INTSTS_TXCF3) /* DMA channel3 transfer complete interrupt */
#define DMA_INT_HTX3 ((uint32_t)DMA_INTSTS_HTXF3) /* DMA channel3 half transfer interrupt */
#define DMA_INT_ERR3 ((uint32_t)DMA_INTSTS_ERRF3) /* DMA channel3 transfer error interrupt */
#define DMA_INT_GLB4 ((uint32_t)DMA_INTSTS_GLBF4) /* DMA channel4 global interrupt */
#define DMA_INT_TXC4 ((uint32_t)DMA_INTSTS_TXCF4) /* DMA channel4 transfer complete interrupt */
#define DMA_INT_HTX4 ((uint32_t)DMA_INTSTS_HTXF4) /* DMA channel4 half transfer interrupt */
#define DMA_INT_ERR4 ((uint32_t)DMA_INTSTS_ERRF4) /* DMA channel4 transfer error interrupt */
#define DMA_INT_GLB5 ((uint32_t)DMA_INTSTS_GLBF5) /* DMA channel5 global interrupt */
#define DMA_INT_TXC5 ((uint32_t)DMA_INTSTS_TXCF5) /* DMA channel5 transfer complete interrupt */
#define DMA_INT_HTX5 ((uint32_t)DMA_INTSTS_HTXF5) /* DMA channel5 half transfer interrupt */
#define DMA_INT_ERR5 ((uint32_t)DMA_INTSTS_ERRF5) /* DMA channel5 transfer error interrupt */

/** DMA flags definition **/
#define DMA_FLAG_GL1    ((uint32_t)DMA_INTSTS_GLBF1) /* DMA Channel1 global flag */
#define DMA_FLAG_TC1    ((uint32_t)DMA_INTSTS_TXCF1) /* DMA Channel1 transfer complete flag */
#define DMA_FLAG_HT1    ((uint32_t)DMA_INTSTS_HTXF1) /* DMA Channel1 half transfer flag */
#define DMA_FLAG_TE1    ((uint32_t)DMA_INTSTS_ERRF1) /* DMA Channel1 transfer error flag */
#define DMA_FLAG_GL2    ((uint32_t)DMA_INTSTS_GLBF2) /* DMA Channel2 global flag */
#define DMA_FLAG_TC2    ((uint32_t)DMA_INTSTS_TXCF2) /* DMA Channel2 transfer complete flag */
#define DMA_FLAG_HT2    ((uint32_t)DMA_INTSTS_HTXF2) /* DMA Channel2 half transfer flag */
#define DMA_FLAG_TE2    ((uint32_t)DMA_INTSTS_ERRF2) /* DMA Channel2 transfer error flag */
#define DMA_FLAG_GL3    ((uint32_t)DMA_INTSTS_GLBF3) /* DMA Channel3 global flag */
#define DMA_FLAG_TC3    ((uint32_t)DMA_INTSTS_TXCF3) /* DMA Channel3 transfer complete flag */
#define DMA_FLAG_HT3    ((uint32_t)DMA_INTSTS_HTXF3) /* DMA Channel3 half transfer flag */
#define DMA_FLAG_TE3    ((uint32_t)DMA_INTSTS_ERRF3) /* DMA Channel3 transfer error flag */
#define DMA_FLAG_GL4    ((uint32_t)DMA_INTSTS_GLBF4) /* DMA Channel4 global flag */
#define DMA_FLAG_TC4    ((uint32_t)DMA_INTSTS_TXCF4) /* DMA Channel4 transfer complete flag */
#define DMA_FLAG_HT4    ((uint32_t)DMA_INTSTS_HTXF4) /* DMA Channel4 half transfer flag */
#define DMA_FLAG_TE4    ((uint32_t)DMA_INTSTS_ERRF4) /* DMA Channel4 transfer error flag */
#define DMA_FLAG_GL5    ((uint32_t)DMA_INTSTS_GLBF5) /* DMA Channel5 global flag */
#define DMA_FLAG_TC5    ((uint32_t)DMA_INTSTS_TXCF5) /* DMA Channel5 transfer complete flag */
#define DMA_FLAG_HT5    ((uint32_t)DMA_INTSTS_HTXF5) /* DMA Channel5 half transfer flag */
#define DMA_FLAG_TE5    ((uint32_t)DMA_INTSTS_ERRF5) /* DMA Channel5 transfer error flag */

/** DMA remap channel request definition **/
#define DMA_REMAP_ADC       ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      & DMA_CHSEL_CH_SEL_1 \
                                      & DMA_CHSEL_CH_SEL_2 \
                                      & DMA_CHSEL_CH_SEL_3 \
                                      & DMA_CHSEL_CH_SEL_4 \
                                      & DMA_CHSEL_CH_SEL_5)) /* DMA Request For ADC */
#define DMA_REMAP_UART1_TX  ((uint32_t)(DMA_CHSEL_CH_SEL_0)) /* DMA Request For UART1_TX */
#define DMA_REMAP_UART1_RX  ((uint32_t)(DMA_CHSEL_CH_SEL_1)) /* DMA Request For UART1_RX */
#define DMA_REMAP_UART2_TX  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1)) /* DMA Request For UART2_TX */
#define DMA_REMAP_UART2_RX  ((uint32_t)(DMA_CHSEL_CH_SEL_2)) /* DMA Request For UART2_RX */
#define DMA_REMAP_UART3_TX  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_2)) /* DMA Request For UART3_TX */
#define DMA_REMAP_UART3_RX  ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2)) /* DMA Request For UART3_RX */
#define DMA_REMAP_UART4_TX  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2)) /* DMA Request For UART4_TX */
#define DMA_REMAP_UART4_RX  ((uint32_t)(DMA_CHSEL_CH_SEL_3)) /* DMA Request For UART4_RX */
#define DMA_REMAP_UART5_TX  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_3)) /* DMA Request For UART5_TX */
#define DMA_REMAP_UART5_RX  ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_3)) /* DMA Request For UART5_RX */
#define DMA_REMAP_SPI1_TX   ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_3)) /* DMA Request For SPI1_TX */
#define DMA_REMAP_SPI1_RX   ((uint32_t)(DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3)) /* DMA Request For SPI1_RX */
#define DMA_REMAP_SPI2_TX   ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3)) /* DMA Request For SPI2_TX */
#define DMA_REMAP_SPI2_RX   ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3)) /* DMA Request For SPI2_RX */
#define DMA_REMAP_SPI3_TX   ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3)) /* DMA Request For SPI3_TX */
#define DMA_REMAP_SPI3_RX   ((uint32_t)(DMA_CHSEL_CH_SEL_4)) /* DMA Request For SPI3_RX */
#define DMA_REMAP_I2C1_TX   ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For I2C1_TX */
#define DMA_REMAP_I2C1_RX   ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For I2C1_RX */
#define DMA_REMAP_I2C2_TX   ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For I2C2_TX */
#define DMA_REMAP_I2C2_RX   ((uint32_t)(DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For I2C2_RX */
#define DMA_REMAP_TIM1_CH1  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM1_CH1 */
#define DMA_REMAP_TIM1_CH2  ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM1_CH2 */
#define DMA_REMAP_TIM1_CH3  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM1_CH3 */
#define DMA_REMAP_TIM1_CH4  ((uint32_t)(DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM1_CH4 */
#define DMA_REMAP_TIM1_COM  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM1_COM */
#define DMA_REMAP_TIM1_UP   ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM1_UP */
#define DMA_REMAP_TIM1_TRIG ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM1_TRIG */
#define DMA_REMAP_TIM2_CH1  ((uint32_t)(DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM2_CH1 */
#define DMA_REMAP_TIM2_CH2  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM2_CH2 */
#define DMA_REMAP_TIM2_CH3  ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM2_CH3 */
#define DMA_REMAP_TIM2_CH4  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_4)) /* DMA Request For TIM2_CH4 */
#define DMA_REMAP_TIM2_UP   ((uint32_t)(DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM2_UP */
#define DMA_REMAP_TIM2_TRIG ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM2_TRIG */
#define DMA_REMAP_TIM3_CH1  ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM3_CH1 */
#define DMA_REMAP_TIM3_CH2  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM3_CH2 */
#define DMA_REMAP_TIM3_CH3  ((uint32_t)(DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM3_CH3 */
#define DMA_REMAP_TIM3_CH4  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM3_CH4 */
#define DMA_REMAP_TIM3_UP   ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM3_UP */
#define DMA_REMAP_TIM3_TRIG ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM3_TRIG */
#define DMA_REMAP_TIM4_CH1  ((uint32_t)(DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM4_CH1 */
#define DMA_REMAP_TIM4_CH2  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM4_CH2 */
#define DMA_REMAP_TIM4_CH3  ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM4_CH3 */
#define DMA_REMAP_TIM4_CH4  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM4_CH4 */
#define DMA_REMAP_TIM4_UP   ((uint32_t)(DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM4_UP */
#define DMA_REMAP_TIM4_TRIG ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM4_TRIG */
#define DMA_REMAP_TIM5_CH1  ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM5_CH1 */
#define DMA_REMAP_TIM5_CH2  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_3 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM5_CH2 */
#define DMA_REMAP_TIM5_CH3  ((uint32_t)(DMA_CHSEL_CH_SEL_4 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM5_CH3 */
#define DMA_REMAP_TIM5_CH4  ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_4 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM5_CH4 */
#define DMA_REMAP_TIM5_UP   ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_4 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM5_UP */
#define DMA_REMAP_TIM5_TRIG ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_4 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM5_TRIG */
#define DMA_REMAP_TIM6_UP   ((uint32_t)(DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_4 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For TIM6_UP */
#define DMA_REMAP_DAC       ((uint32_t)(DMA_CHSEL_CH_SEL_0 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_4 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For DAC */
#define DMA_REMAP_GCLK_TRIG ((uint32_t)(DMA_CHSEL_CH_SEL_1 \
                                      | DMA_CHSEL_CH_SEL_2 \
                                      | DMA_CHSEL_CH_SEL_4 \
                                      | DMA_CHSEL_CH_SEL_5)) /* DMA Request For GCLK_TRIG */
#define DMA_REMAP_RESERVED  ((uint32_t)0x0000003FU)           /* DMA Request reserved value */

/** DMA Channelx interrupt pending bit masks definition **/
#define DMA_CH1_INT_MASK ((uint32_t)(DMA_INTSTS_GLBF1 | DMA_INTSTS_TXCF1 | DMA_INTSTS_HTXF1 | DMA_INTSTS_ERRF1))
#define DMA_CH2_INT_MASK ((uint32_t)(DMA_INTSTS_GLBF2 | DMA_INTSTS_TXCF2 | DMA_INTSTS_HTXF2 | DMA_INTSTS_ERRF2))
#define DMA_CH3_INT_MASK ((uint32_t)(DMA_INTSTS_GLBF3 | DMA_INTSTS_TXCF3 | DMA_INTSTS_HTXF3 | DMA_INTSTS_ERRF3))
#define DMA_CH4_INT_MASK ((uint32_t)(DMA_INTSTS_GLBF4 | DMA_INTSTS_TXCF4 | DMA_INTSTS_HTXF4 | DMA_INTSTS_ERRF4))
#define DMA_CH5_INT_MASK ((uint32_t)(DMA_INTSTS_GLBF5 | DMA_INTSTS_TXCF5 | DMA_INTSTS_HTXF5 | DMA_INTSTS_ERRF5))

/*** DMA Macro Definition End ***/


/*** DMA Driving Functions Declaration ***/
void DMA_DeInit(DMA_ChannelType* DMAChx);
void DMA_Init(DMA_ChannelType* DMAChx, DMA_InitType* DMA_InitParam);
void DMA_StructInit(DMA_InitType* DMA_InitParam);
void DMA_EnableChannel(DMA_ChannelType* DMAChx, FunctionalState Cmd);
void DMA_ConfigInt(DMA_ChannelType* DMAChx, uint32_t DMAInt, FunctionalState Cmd);
void DMA_SetCurrDataCounter(DMA_ChannelType* DMAChx, uint16_t DataNumber);
uint16_t DMA_GetCurrDataCounter(const DMA_ChannelType* DMAChx);
FlagStatus DMA_GetFlagStatus(uint32_t DMAFlag, const DMA_Module* DMAy);
void DMA_ClearFlag(uint32_t DMAFlag, DMA_Module* DMAy);
INTStatus DMA_GetIntStatus(uint32_t DMA_IT, const DMA_Module* DMAy);
void DMA_ClrIntPendingBit(uint32_t DMA_IT, DMA_Module* DMAy);
void DMA_RequestRemap(uint32_t DMA_REMAP, const DMA_Module* DMAy, DMA_ChannelType* DMAChx, FunctionalState Cmd);


#ifdef __cplusplus
}
#endif

#endif /*__N32G05X_DMA_H__ */

